Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/education/vocational_education_and_training/fas_training_allowances.html.txt.tmx
Source language: en
Languages: ga

source: Further Education and Training (FET) allowances
ga: Liúntais Bhreisoideachais agus Oiliúna (BOO)

source: • Social welfare payments and the FET training allowance
ga: • Íocaíochtaí leasa shóisialaigh agus liúntais oiliúna FET liúntais

source: Further Education and Training (FET) training courses provided in Education and Training Boards (ETB) training centres are free (except for evening courses) and you may be paid a training allowance for the duration of your course
ga: Tá cúrsaí oiliúna Breisoideachais agus Oiliúna (BOO) a sholáthraítear in ionaid oiliúna Boird Oideachais agus Oiliúna (BOO) saor in aisce (seachas i gcás cúrsaí tráthnóna) agus b’fhéidir go n-íocfar liúntas oiliúna leat d’fhad do chúrsa

source: You can also claim an accommodation allowance if you need to live away from home for the duration of the course or a travel allowance if you live 3 miles or more from the course centre
ga: Is féidir leat cur isteach arliúntas lóistín freisin má chaitheann tú maireachtáil as baile i rith an chúrsa agus liúntas taistil má mhaireann tú 3 mhíle nó níos mó ó láthair an chúrsa

source: You may qualify for a free childcare place for your child
ga: D’fhéadfá cáiliú d’áit chúraim leanaí in aisce dod’ leanbh

source: FET allowances are not taxable
ga: Níl liúntais FET incháinithe

source: To get a FET training allowance you must be entitled to a qualifying social welfare payment, such as Jobseeker's Allowance or Jobseeker's Benefit
ga: Chun liúntas oiliúna BOO a fháil, caithfidh tú a bheith i dteideal íocaíocht cháilitheach leasa shóisialaigh a fháil, ar nós Liúntas Cuardaitheora Poist nó Sochar Cuardaitheora Poist

source: However, if you are aged under 18 and attending a Community Training Centre you will get an age-related training allowance – see ‘Rates’ below
ga: Ach má tá tú faoi 18 mbliana d’aois agus má tá tú ag freastal ar Ionad Oiliúna Pobail, gheobhaidh tú liúntas oiliúna bunaithe ar aois – féach ‘Rátaí’ thíos

source: FÁS, SOLAS and ETBs
ga: FÁS, SOLAS agus Boird Oideachais agus Oiliúna

source: FÁS was dissolved and some of its functions were transferred to SOLAS - the new further education and training authority
ga: Rinneadh FÁS a dhíscaoileadh agus aistríodh cuid dá fheidhmeanna go dtí SOLAS – an t-údarás nua breisoideachais agus oiliúna

source: In 2014, the FÁS training division was transferred to the 16 Education and Training Boards (ETBs) which replaced VECs
ga: In 2014, aistríodh rannóg oiliúna FÁS chuig na 16 Bhord Oideachais agus Oiliúna (BOOanna) a tháinig in ionad Coistí Gairmoideachais

source: Social welfare payments and the FET training allowance
ga: Íocaíochtaí leasa shóisialaigh agus liúntais oiliúna FET liúntais

source: Your payment when on a FET training course will depend on the social welfare payment you are getting.There is no qualifying period, which means you do not need to have been getting a social welfare payment for a certain period of time
ga: Beidh d’íocaíocht agus tú ar chúrsa FET ag brath ar an íocaíocht leasa shóisialaigh atá á fáil agat. Níl aon tréimhse cháilitheach, rud a chiallaíonn nach bhfuil ort a bheith ag fáil Íocaíocht Leasa Shóisialaigh ar feadh tréimhse ar leith

source: Qualified adult dependant: If you are getting an Increase for a Qualified Adult for your spouse, civil partner or cohabitant as part of your social welfare payment, you can continue to get this while your adult dependant is participating on a FET course
ga: Cleithiúnaí fásta cáilithe: Má tá Méadú do Dhuine Fásta Cáilithe á fháil agat do do chéile, páirtnéir sibhialta nó do chomháitritheoir mar chuid de d’íocaíocht leasa shóisialaigh, féadfaidh tú leanúint leis seo a fháil fad a ghlacann do chleithiúnaí fásta páirt ar chúrsa BOO

source: Your adult dependant will not get a FET training allowance
ga: Ní bhfaighidh do chleithiúnaí fásta liúntas oiliúna BOO

source: However, they may qualify for travel and other allowances
ga: B’fhéidir go gcáileoidh siad do liúntais taistil agus do liúntais eile, áfach

source: Check with the course provider if these allowances are available with their course
ga: Seiceáil le soláthraí an chúrsa má tá na liúntais seo ar fáil lena gcúrsa

source: Jobseeker's Allowance or Supplementary Welfare Allowance
ga: Liúntas Cuardaitheora Poist nó Liúntas Leasa Forlíontach

source: Since 1 January 2014, if you are a new participant aged 26 or over and getting Jobseeker's Allowance (JA) or Supplementary Welfare Allowance (SWA) you will have your payment suspended, but you will get a FET training allowance of the same amount
ga: Más rud é gur rannpháirtí nua atá 26 bliain d’aois nó níos sine thú agus go bhfuil tú ag fáil Liúntas Cuardaitheora Poist (JA) nó Liúntas Leasa Forlíontach (SWA), cuirfear d’íocaíocht ar ceal ón 1 Eanáir 2014 agus gheobhaidh tú liúntas oiliúna FET den mhéid céanna

source: If you are getting a reduced age-related Jobseeker's Allowance you will have your payment suspended, but you will get a FET training allowance of €160
ga: Má tá tú ag fáil Liúntas Cuardaitheora Poist aoischoibhneasa laghdaithe, cuirfear d’íocaíocht ar ceal agus gheobhaidh tú liúntas oiliúna FET is fiú €160

source: Any means that were deducted from your JA will also be deducted from your FET training allowance
ga: Aon acmhainní a baineadh as do Liúntas Cuardaitheora Poist, bainfear iad freisin as do liúntas oiliúna FET

source: This also applies to people getting a reduced age-related basic Supplementary Welfare Allowance
ga: Baineann sé sin freisin le daoine atá ag fáil Liúntas Leasa Forlíontach aoischoibhneasa bunúsach laghdaithe

source: If your entitlement to Jobseeker's Allowance or Supplementary Welfare Allowance stops during the FET course, your FET training allowance will stop
ga: Má scoireann tú de bheith i dteideal Liúntas Cuardaitheora Poist nó Liúntas Leasa Forlíontach le linn an chúrsa FET, cuirfear deireadh le do liúntas oiliúna FET

source: If you are getting Jobseeker's Benefit your social welfare payment will stop and you will get a FET training allowance of the same amount
ga: Má tá tú ag fáil Sochar Cuardaitheora Poist, cuirfear deireadh le d’íocaíocht leasa shóisialaigh agus gheobhaidh tú liúntas oiliúna FET den mhéid céanna

source: If you do not find employment when your course ends, you can reapply for Jobseeker’s Benefit
ga: Mura bhfaigheann tú post agus do chúrsa thart, is féidir leat iarratas a dhéanamh arís ar Shochar Cuardaitheora Poist

source: Your Jobseeker’s Benefit claim may be linked to your previous claim for Jobseeker’s Benefit - this means that your claim is not treated as a new claim
ga: D’fhéadfadh d’éileamh ar Shochar Cuardaitheora Poist bheith nasctha le d’éileamh roimhe ar Shochar Cuardaitheora Poist – d’fhágfadh sé sin nach gcaithfí le d’éileamh mar éileamh nua

source: Disability Allowance or Blind Pension
ga: Liúntas Míchumais nó Pinsean na nDall

source: Your Disability Allowance or Blind Pension is suspended but you will get a FET training allowance of the same amount
ga: Cuirtear do Liúntas Míchumais nó Pinsean na nDall ar fionraí ach gheobhaidh tú liúntas oiliúna FET den mhéid céanna

source: The rules that apply to your original social welfare payment also apply to your FET training allowance
ga: Na rialacha a bhfuil feidhm acu maidir le d’íocaíocht bhunaidh leasa shóisialaigh, tá feidhm acu freisin maidir le do liúntas oiliúna FET

source: You must inform social welfare of any changes to your circumstances
ga: Má tá aon athrú ar do chúinsí féin, ní mór duit cuir in iúl d’oifig leasa shóisialaigh

source: You will also keep any secondary benefits, such as your medical card or travel pass
ga: Chomh maith leis sin, coimeádfaidh tú aon sochair thánaisteacha, ar nós do chárta leighis nó do phas taistil

source: If you have a disability, the Education and Training Board will apply flexible sick leave arrangements if necessary
ga: Má tá tú faoi mhíchumas, cuirfidh an Bord Oideachais agus Oiliúna socruithe solúbtha saoire breoiteachta i bhfeidhm más gá

source: Illness Benefit or Invalidity Pension
ga: Sochar Breoiteachta agus Pinsean Easláinte

source: You will keep your Illness Benefit or Invalidity Pension (but you must get an exemption from the Department of Social Protection authorising you to do the FET course)
ga: Coimeádfaidh tú do Shochar Breoiteachta nó do Phinsean Easláine (ach caithfidh tú díolúine a fháil ón Roinn Coimirce Sóisialaí a údaraíonn tú chun an cúrsa BOO a dhéanamh)

source: The rules that apply to your social welfare payment will continue to apply while you are on the FET course
ga: Beidh na rialacha a bhaineann le d’íocaíocht leasa shóisialaigh i gceist go fóill fad a ghlacann tú páirt ar an gcúrsa BOO

source: You will keep your secondary benefits
ga: Coimeádfaidh tú do shochair thánaisteacha

source: You will keep your One-Parent Family Payment
ga: Chomh maith leis sin, coimeádfaidh tú d’Íocaíocht Teaghlach Aontuismitheora

source: Weekly training allowances are as follows:
ga: Is iad seo a leanas na liúntais oiliúna sheachtainiúla:

source: │FET training allowance │Rate per week (full-time) │
ga: │Liúntas oiliúna FET │Ráta in aghaidh na seachtaine (lánaimseartha) │

source: │Jobseeker's Allowance or SWA (aged 26 and over) │same rate as your social welfare payment │
ga: │Liúntas Cuardaitheora Poist nó Liúntas Leasa Forlíontach (níos óige ná 26 bliain d’aois) │€160* │

source: │One-Parent Family Payment or Illness Benefit or Invalidity Pension │ │ │ │keep your existing social welfare payment │
ga: │Liúntas Míchumais │is ionann an ráta seo agus ráta d’íocaíochta leasa shóisialaigh │

source: │No social welfare payment (aged 16-17) │€40 │
ga: │Gan íocaíocht leasa shóisialaigh (16-17 bliain d’aois) │€40 │

source: *If your social welfare payment is more than this amount, you will get the same rate as your social welfare payment
ga: *Más mó d’íocaíocht leasa shóisialaigh ná an méid seo, beidh an ráta seo comhionann le ráta d’íocaíochta leasa shóisialaigh

source: Since January 2014, new participants who move from an age-related reduced rate of Jobseeker’s Allowance will get a top-up rate of €160 per week
ga: Fógraíodh i mBuiséad 2014 go dtabharfaí ráta breisithe de €160 in aghaidh na seachtaine ó mhí Eanáir 2014 do rannpháirtithe SOLAS atá 25 bliain d’aois agus a bhogann ó ráta Liúntais Chuardaitheora Poist aoischoibhneasa laghdaithe - bainfidh sé sin le rannpháirtithe nua amháin

source: Since 1 January 2014, people getting one of the social welfare payments listed below will not get a FET training allowance
ga: Ón 1 Eanáir 2014 ar aghaidh, ní thabharfar liúntas oiliúna BOO do dhaoine a fhaigheann ceann de na híocaíochtaí leasa shóisialaigh a liostaítear thíos

source: However, they will continue to get their social welfare payment
ga: Leanfaidh siad lena n-íocaíocht leasa shóisialaigh a fháil, áfach

source: A Christmas Bonus will be paid to all trainees who have been unemployed for more than 15 months (you must have been getting your jobseeker’s payment and/or your training allowance for 15 months)
ga: Íocfar Bónas na Nollag le gach oiliúnaí a bhí dífhostaithe ar feadh breis agus 15 mhí (caithfidh go raibh d’íocaíocht chuardaitheora poist agus/nó do liúntas oiliúna á bhfáil agat ar feadh 15 mhí)

source: You will also get a Christmas Bonus if you were getting a long-term social welfare payment and are now getting a training allowance
ga: Ina theannta sin, gheobhaidh tú Bónas na Nollag má bhí íocaíocht fhadtéarmach leasa shóisialaigh á fáil agat agus má tá liúntas oiliúna á fháil anois agat

source: In order to apply for a place on a FET course, you should register with your local employment services office or Intreo centre
ga: Chun iarratas a dhéanamh ar áit ar chúrsa FET, caithfidh tú clárú ar dtús le d’oifig áitiúil leasa shóisialaigh nó le hIonad Intreo

source: You will be interviewed in order to identify the course that will best suit your needs
ga: Cuirfear agallamh ort chun an cúrsa a oireann is fearr do do riachtanais a shainaithint

source: Due to the pressure on some courses, you may not get a place immediately on the course of your choice
ga: De bharr an bhrú ar roinnt cúrsaí, d’fhéadfadh nach bhfaighfeá áit ar an gcúrsa is mian leat lom láithreach

source: For more information about available training courses contact your ETB Training Centre
ga: Chun teacht ar bhreis faisnéise faoi chúrsaí oiliúna atá ar fáil, déan teagmháil le d’Ionad Oiliúna BOO
